{"class_name": "Sequential", "config": [{"class_name": "GRU", "config": {"U_regularizer": null, "input_length": null, "name": "gru_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "output_dim": 128, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dtype": "float32", "input_dim": 28, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "batch_input_shape": [null, null, 28]}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 128}}, {"class_name": "RepeatVector", "config": {"trainable": true, "name": "repeatvector_1", "n": 15}}, {"class_name": "GRU", "config": {"U_regularizer": null, "name": "gru_2", "inner_activation": "hard_sigmoid", "go_backwards": false, "output_dim": 128, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 128, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "input_length": null}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 28}}, "trainable": true, "name": "timedistributed_1"}}]}